Tekla Open API Reference for Tekla Structures 2025
RebarLapping.LappingType Property
 Gets or sets the lapping type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarLapping.LappingTypeEnum LappingType { get; set; }
Public Property LappingType As RebarLapping.LappingTypeEnum
	Get
	Set
Property Value
Type: RebarLapping.LappingTypeEnum
See Also
Reference
RebarLapping Class
Tekla.Structures.Model Namespace